Docs: Add docs - second pass
